# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [19,27,  44,40,  38,94]  # P3/8
  - [96,68,  86,152,  180,137]  # P4/16
  - [140,301,  303,264,  238,542]  # P5/32
  - [436,615,  739,380,  925,792]  # P6/64

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],                  # 0-P1/2
   [-1, 3, ConvC3Block, [128, 3, 2, True]],  # 1-P2/4
   [-1, 9, ConvC3Block, [256, 3, 2, True]],  # 2-P3/8
   [-1, 9, ConvC3Block, [512, 3, 2, True]],  # 3-P4/16
   [-1, 3, ConvC3Block, [768, 3, 2, True]],  # 4-P5/32
   [-1, 1, Conv, [1024, 3, 2]],              # 5-P6/64
   [-1, 1, SPP, [1024, [3, 5, 7]]],          # 6
   [-1, 3, C3Block, [1024, False]],          # 7
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [768, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P5
   [-1, 3, C3Block, [768, False]],  # 11

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3Block, [512, False]],  # 15

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3Block, [256, False]],  # 19 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3Block, [512, False]],  # 22 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3Block, [768, False]],  # 25 (P5/32-large)

   [-1, 1, Conv, [768, 3, 2]],
   [[-1, 8], 1, Concat, [1]],  # cat head P6
   [-1, 3, C3Block, [1024, False]],  # 28 (P6/64-xlarge)

   [[19, 22, 25, 28], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5, P6)
  ]
